modm-ext/archive-stmicro-svd/rm_rm0351_stm32l471qei3.svd
      <fields>
        <field>
          <name>SCDT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
        <field>
          <name>BKSCD</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>AWFOSR</name>
          <bitOffset>16</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>AWFORD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>CH6WDATR</name>
        <addressOffset>0xcc</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>WDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CH6DATINR</name>
        <addressOffset>0xd0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INDAT0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>INDAT1</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CH7CFGR1</name>
        <addressOffset>0xe0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SITP</name>
          <bitOffset>0</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>SPICKSEL</name>
          <bitOffset>2</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
        <field>
          <name>SCDEN</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CKABEN</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHEN</name>
          <bitOffset>7</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CHINSEL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>DATMPX</name>
          <bitOffset>12</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>DATPACK</name>
          <bitOffset>14</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>CH7CFGR2</name>
        <addressOffset>0xe4</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>DTRBS</name>
          <bitOffset>3</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>OFFSET</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>CH7AWSCDR</name>
        <addressOffset>0xe8</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>SCDT</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
        <field>
          <name>BKSCD</name>
          <bitOffset>12</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>AWFOSR</name>
          <bitOffset>16</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>AWFORD</name>
          <bitOffset>22</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
      </fields>
      <register>
        <name>CH7WDATR</name>
        <addressOffset>0xec</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>WDATA</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>CH7DATINR</name>
        <addressOffset>0xf0</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>INDAT0</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>INDAT1</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0CR1</name>
        <addressOffset>0x100</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DFEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JSWSTART</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>2</bitOffset>
          <bitWidth>30</bitWidth>
        </field>
        <field>
          <name>JSYNC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JSCAN</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JDMAEN</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEXTSEL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>JEXTEN</name>
          <bitOffset>13</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>RSWSTART</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RCONT</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSYNC</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RDMAEN</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RCH</name>
          <bitOffset>24</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>FAST</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWFSEL</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0CR2</name>
        <addressOffset>0x104</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JEOCIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>REOCIE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JOVRIE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROVRIE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWDIE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>SCDIE</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CKABIE</name>
          <bitOffset>6</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>7</bitOffset>
          <bitWidth>25</bitWidth>
        </field>
        <field>
          <name>EXCH</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>AWDCH</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0ISR</name>
        <addressOffset>0x108</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JEOCF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>REOCF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JOVRF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROVRF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWDF</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>5</bitOffset>
          <bitWidth>11</bitWidth>
        </field>
        <field>
          <name>JCIP</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RCIP</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CKABF</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>SCDF</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0ICR</name>
        <addressOffset>0x10c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>0</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
        <field>
          <name>CLRJOVRF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CLRROVRF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CLRCKABF</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>CLRSCDF</name>
          <bitOffset>24</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0JCHGR</name>
        <addressOffset>0x110</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JCHG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0FCR</name>
        <addressOffset>0x114</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IOSR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>8</bitOffset>
          <bitWidth>21</bitWidth>
        </field>
        <field>
          <name>FOSR</name>
          <bitOffset>16</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>FORD</name>
          <bitOffset>29</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0JDATAR</name>
        <addressOffset>0x118</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JDATACH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>3</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>JDATA</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0RDATAR</name>
        <addressOffset>0x11c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>RDATACH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>3</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>RPEND</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RDATA</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0AWHTR</name>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BKAWH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>AWHT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0AWLTR</name>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>BKAWL</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>4</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>AWLT</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0AWSR</name>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>AWLTF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>AWHTF</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0AWCFR</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>CLRAWLTF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>CLRAWHTF</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>16</bitOffset>
          <bitWidth>16</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0EXMAX</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EXMAXCH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>3</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>EXMAX</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0EXMIN</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>EXMINCH</name>
          <bitOffset>0</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>3</bitOffset>
          <bitWidth>5</bitWidth>
        </field>
        <field>
          <name>EXMIN</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT0CNVTIMR</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>0</bitOffset>
          <bitWidth>4</bitWidth>
        </field>
        <field>
          <name>CNVCNT</name>
          <bitOffset>4</bitOffset>
          <bitWidth>28</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT1CR1</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>DFEN</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JSWSTART</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>2</bitOffset>
          <bitWidth>30</bitWidth>
        </field>
        <field>
          <name>JSYNC</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JSCAN</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JDMAEN</name>
          <bitOffset>5</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JEXTSEL</name>
          <bitOffset>8</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>JEXTEN</name>
          <bitOffset>13</bitOffset>
          <bitWidth>2</bitWidth>
        </field>
        <field>
          <name>RSWSTART</name>
          <bitOffset>17</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RCONT</name>
          <bitOffset>18</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RSYNC</name>
          <bitOffset>19</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RDMAEN</name>
          <bitOffset>21</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RCH</name>
          <bitOffset>24</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
        <field>
          <name>FAST</name>
          <bitOffset>29</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWFSEL</name>
          <bitOffset>30</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT1CR2</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JEOCIE</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>REOCIE</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JOVRIE</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROVRIE</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWDIE</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>5</bitOffset>
          <bitWidth>27</bitWidth>
        </field>
        <field>
          <name>EXCH</name>
          <bitOffset>8</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>AWDCH</name>
          <bitOffset>16</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT1ISR</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JEOCF</name>
          <bitOffset>0</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>REOCF</name>
          <bitOffset>1</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>JOVRF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>ROVRF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>AWDF</name>
          <bitOffset>4</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>5</bitOffset>
          <bitWidth>27</bitWidth>
        </field>
        <field>
          <name>JCIP</name>
          <bitOffset>13</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>RCIP</name>
          <bitOffset>14</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT1ICR</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>s</name>
          <bitOffset>0</bitOffset>
          <bitWidth>32</bitWidth>
        </field>
        <field>
          <name>CLRJOVRF</name>
          <bitOffset>2</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
        <field>
          <name>CLRROVRF</name>
          <bitOffset>3</bitOffset>
          <bitWidth>1</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT1JCHGR</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>JCHG</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>8</bitOffset>
          <bitWidth>24</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT1FCR</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
      <fields>
        <field>
          <name>IOSR</name>
          <bitOffset>0</bitOffset>
          <bitWidth>8</bitWidth>
        </field>
        <field>
          <name>s</name>
          <bitOffset>8</bitOffset>
          <bitWidth>21</bitWidth>
        </field>
        <field>
          <name>FOSR</name>
          <bitOffset>16</bitOffset>
          <bitWidth>10</bitWidth>
        </field>
        <field>
          <name>FORD</name>
          <bitOffset>29</bitOffset>
          <bitWidth>3</bitWidth>
        </field>
      </fields>
      <register>
        <name>FLT1JDATAR</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
      </register>
